export const deviceParamsMap = {
  devicePointType: {
    1: '一类视频',
    2: '二类视频',
    3: '三类视频',
    4: '公安内部场所视频监控',
    9: '其他'
  },
  hasPickUp: {
    1: '有',
    0: '-'
  },
  parentDevice: {
    '-1': '-'
  },
  constructionUnitNum: {
    1: '公安机关',
    2: '环保部门',
    3: '文博部门',
    4: '医疗部门',
    5: '旅游管理',
    6: '新闻广电',
    7: '食品医疗监督管理部门',
    8: '教育管理部门',
    9: '检察院',
    10: '法院',
    11: '金融部门',
    12: '交通部门',
    13: '住房和城乡建设部门',
    14: '水利部门',
    15: '林业部门',
    16: '安全生产监督部门',
    17: '市政市容委',
    18: '国土局'
  },
  department: {
    1: '警务督察',
    2: '治安管理',
    3: '交通管理',
    4: '信访',
    5: '出入境',
    6: '监管',
    7: '检查站',
    8: '其他'
  },
  deviceVendor: {
    1: '海康威视',
    2: '大华',
    3: '天地伟业',
    4: '科达',
    5: '安讯士',
    6: '博世',
    7: '亚安',
    8: '英飞拓',
    9: '宇视',
    10: '海信',
    11: '中星电子',
    12: '明景',
    13: '联想',
    14: '中兴',
    15: '佳都科技',
    16: '华为',
    57: '海康云存储',
    99: '其他'
  },
  ipcType: {
    1: '可控球机',
    2: '固定球机',
    3: '固定枪机',
    4: '云台枪机',
    5: '卡口枪机',
    99: '其他'
  },
  inType: {
    1: '视频平台直连',
    2: 'DVR/NVR接入'
  },
  ipcFunctionType: {
    1: '车辆卡口',
    2: '人脸卡口（含人员）',
    3: '微卡口',
    4: '特征摄像机',
    5: '普通监控',
    99: '其他'
  },
  videoCodingType: {
    1: 'MPEG-4',
    2: 'H.264',
    3: 'SVAC',
    4: '3GP',
    5: 'H.265',
    99: '其他'
  },
  resolutionType: {
    1: 'QCIF',
    2: 'CIF',
    3: '4CIF',
    4: 'D1',
    5: '720P',
    6: '1080P/I',
    99: '其他'
  },
  ipcLightFillType: {
    0: '-',
    1: '无补光',
    2: '红外补光',
    3: '白光补光',
    9: '其他补光'
  },
  publicLocationType: {
    1: '省际检查站',
    2: '党政机关',
    3: '车站码头',
    4: '中心广场',
    5: '体育场馆',
    6: '商业中心',
    7: '宗教场所',
    8: '校园周边',
    9: '治安复杂区域',
    10: '交通干线',
    90: '旅业场所',
    91: '娱乐场所',
    96: '市际公安检查站',
    97: '涉外场所',
    98: '边境沿线',
    99: '旅游景区'
  },
  internelLocationType: {
    2: '执法办案场所接入',
    6: '交通内部接入（交管专用）',
    64: '服务场所接入',
    65: '办公场所接入',
    66: '训练场所接入',
    67: '警用物资保管场所接入',
    71: '治安检查场所接入（重点指挥图像）',
    76: '监管场所接入',
    77: '其他内部场所接入'
  },
  ipcInOrOut: {
    1: '室外',
    2: '室内'
  },
  ipcPosition: {
    0: '-',
    1: '东',
    2: '西',
    3: '南',
    4: '北',
    5: '东南',
    6: '东北',
    7: '西南',
    8: '西北'
  },
  networkConnected: {
    0: '已联网',
    1: '未联网'
  },
  networkInType: {
    1: '公安信息网',
    2: '视频专网',
    3: '交管专网',
    4: '互联网',
    5: '政务网',
    6: '企事业单位专网',
    7: '私有局域网',
    8: '旅业/娱乐场所专网',
    9: '其他公安业务专网',
    99: '其他'
  },
  connectProtocol: {
    0: 'SIP',
    1: 'SDK',
    2: 'ONVIF'
  },
  deviceStatus: {
    0: '在用',
    1: '维修',
    2: '拆除'
  },
  inspectionStatus: {
    1: '在线',
    0: '离线'
  },
  videoLoss: {
    1: '异常',
    0: '-'
  },
  colorDistortion: {
    1: '异常',
    0: '-'
  },
  videoBlurred: {
    1: '异常',
    0: '-'
  },
  abnormalBrightness: {
    1: '异常',
    0: '-'
  },
  videoInterference: {
    1: '异常',
    0: '-'
  },
  videoFreeze: {
    1: '异常',
    0: '-'
  },
  videoOcclusion: {
    0: '-'
  },
  sceneChange: {
    1: '异常',
    0: '-'
  },
  onlineTime: {
    0: '-'
  },
  offlineTime: {
    0: '-'
  },
  signalDelay: {
    0: '-'
  },
  videoStreamingDelay: {
    0: '-'
  },
  keyFrameDelay: {
    0: '-'
  },
  isCached: {
    1: '是',
    0: '否'
  }
}
